C09/Nz50/Nz50_ref/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         50000;

deltaT          1;

writeControl    timeStep;

writeInterval   10;

purgeWrite      1;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep    yes;


functions
{
    forceCoeffs1
    {
	type        forceCoeffs;
	libs        ("libforces.so");
	writeControl	timeStep;
	writeInterval	1;
	log         true;
    	patches     ("lowerWall");
	U	    U;
	p	    p;
	rho	    rhoInf;
	rhoInf	    1560;
	liftDir     (0 0 1);
    	dragDir     (-1 0 0);
	CofR	    (0.335 0 0);
    	pitchAxis   (0 1 0);
    	magUInf     0.2797;
    	lRef        0.335;
    	Aref        0.0112;
    }
    wallShearStress1
    {
        type            wallShearStress;

        // funciona na maioria das versões do OpenFOAM:
        libs            ("libfieldFunctionObjects.so");
        // se essa linha der erro, tente:
        // libs         (fieldFunctionObjects);

        // paredes que você quer:
        patches         (lowerWall);

        // gera somente quando o solver escrever (mais leve):
        executeControl  writeTime;
        writeControl    writeTime;

        writeToFile     true;   // postProcessing/wallShearStress1/<tempo>/
        log             true;
    }
}
// ************************************************************************* //








